{
  "person": [
    {
      "name": "Allan Beckett",
      "title": "Founder and Director",
      "image": "/assets/img/allan-beckett.jpg",
      "introduction": "Allan founded Carnelian Search with the desire to serve charitable and faith-based organisations with the same level of care and professionalism that is used to find the Chief Executive of a FTSE100 business."
    },
    {
      "name": "Jonathan Payne",
      "title": "Associate",
      "image": "/assets/img/jonathan-payne.jpg",
      "introduction": "Jonathan joined Carnelian as an Associate at the beginning of 2019. After a short spell working with commercial clients, he moved to the search firm Perrett Laver, where he was part of a growing practice serving schools and other educational organisations."
    },
    {
      "name": "Siobhan Breslin",
      "title": "Executive Assistant",
      "introduction": "Siobhan has joined Carnelian part-time to assist with administration. She is currently studying for a degree in Psychology, having obtained her first degree in Business Studies from Nottingham Trent University. She enjoyed a career in corporate benefits before becoming a mother to her three children.",
      "image": "/assets/img/siobhan-breslin.jpg"
    },
    {
      "name": "Andrew Stockbridge",
      "title": "Consultant",
      "image": "/assets/img/andrew-stockbridge.jpg",
      "introduction": "Andrew has over 25 years’ experience in the charity sector. Prior to charity leadership he worked in commercial business development and HR as a consultant and manager. He has held various senior positions along with providing support and guidance for other charities, businesses and missions. In the last six years he has recruited for 30 charities and businesses."
    },
    {
      "name": "Alice Maclean",
      "title": "Consultant",
      "image": "/assets/img/alice-maclean.jpg",
      "introduction": "Alice is passionate about supporting individuals and organisations to realise their full potential. It is this passion that drew her into recruitment. Initially Alice worked on graduate level appointments with Mayfair based firm, RMS Recruitment, before later moving into Executive Search with Forrester Partners. Alice joined Macaulay Search in 2011 as a Research Consultant where she worked on Director and Board Level appointments for a variety of charities. "
    }
  ]
}