{
  "person": [
    {
      "name": "Allan Beckett",
      "title": "Consultant & Founder",
      "image": "/assets/img/ab.png",
      "introduction": "Allan is the founder of Carnelian Search. He started his career in executive search at Lygon Group, helping some of the UK’s largest businesses to appoint C-suite executives and Non-Executive Directors. After working in the charity sector, he set up Carnelian with the goal of serving organisations that have a strong charitable or social purpose. He has led on CEO, trustee, and Director-level appointments for a wide range of clients. He has a master’s degree in Physics and Philosophy from the University of Oxford. ",
      "role": "staff"
    },
    {
      "name": "Jonathan Payne",
      "title": "Consultant",
      "image": "/assets/img/jp.png",
      "introduction": "Jonathan was previously at the executive search firm Perrett Laver, where he was part of a growing practice serving schools and other educational organisations. Whilst there, Jonathan led the research for the appointments of Headteachers, Chief Operating Officers and other senior leaders for HMC schools in and outside the UK. He joined the Carnelian team in 2019. He holds a BA in English Language and Literature from the University of Oxford.",
      "role": "staff"
    },
    {
      "role": "staff",
      "name": "Abigail Marthinet-Glover",
      "title": "Consultant",
      "introduction": "Abi graduated from Oxford University in 2019 having read History, and went on to do a MA in Early Modern History at King's College London. She joined Carnelian part-time whilst completing her masters, and is now one of our consultants. She sits as a trustee on two faith-based charity boards.",
      "image": "/assets/img/amg.png"
    },
    {
      "role": "staff",
      "name": "Emilia Pickering",
      "title": "Researcher",
      "image": "/assets/img/ep.jpg.png",
      "introduction": "Emilia is a music graduate from King’s College London and completed her degree in 2020. She has since worked for a Christian music charity whilst also studying for a Diploma in Biblical Theology at Moore College, Sydney. "
    },
    {
      "role": "staff",
      "name": "Deborah Cartmill",
      "title": "Researcher",
      "image": "/assets/img/dc.png",
      "introduction": "Deborah read English Literature at the University of Cambridge and graduated in 2021. She worked as a ministry intern for a year after graduation, before joining Carnelian Search."
    },
    {
      "name": "Siobhan Breslin",
      "title": "Executive Assistant",
      "introduction": "Siobhan joined Carnelian part-time in 2018 to assist with administration. In 2019 she completed her second degree, in Psychology, having obtained her first degree in Business Studies from Nottingham Trent University. She enjoyed a career in corporate benefits before becoming a mother to her three children. Today, she also practices as a mental health counsellor.",
      "image": "/assets/img/siobhan-breslin.jpg",
      "role": "staff"
    },
    {
      "name": "Andrew Stockbridge",
      "title": "Consultant",
      "image": "/assets/img/andrew-stockbridge.jpg",
      "introduction": "Andrew was previously CEO of the Christian charity Toybox and Interim CEO of Spurgeons theological college. He has also held senior roles in Scripture Union, YMCA and the Baptist Missionary Society, and has been Board Chairman and Trustee of various charities. Over the last 8 years he has helped with many executive appointments. He joined the Carnelian team in 2018. ",
      "role": "staff"
    },
    {
      "role": "advisor",
      "name": "Tayo Arikawe",
      "title": "International Director, Langham Partnership"
    },
    {
      "role": "advisor",
      "name": "Simon Barrington",
      "title": "Founder of Forge Leadership and previous CEO of Samaritan’s Purse"
    },
    {
      "role": "advisor",
      "name": "Andrew Barton",
      "title": "Fundraising and strategy consultant"
    },
    {
      "role": "advisor",
      "name": "Andy Dipper",
      "title": "Previous Principal and CEO at All Nations College"
    },
    {
      "role": "advisor",
      "name": "Jill Garret",
      "title": "Executive coach and mentor"
    },
    {
      "role": "advisor",
      "name": "Sir Charles Hoare",
      "title": "Trustee and consultant"
    },
    {
      "role": "advisor",
      "name": "Nola Leach",
      "title": "Previous CEO of CARE"
    },
    {
      "role": "advisor",
      "name": "Charles McLachlan",
      "title": "Executive coach and founder of the CEO Growth Academy"
    },
    {
      "role": "advisor",
      "name": "Alastair Reid",
      "title": "General Secretary TISCA and previous Headteacher"
    },
    {
      "role": "advisor",
      "name": "Ann Saunders",
      "title": "Director for People at Wycliffe UK"
    }
  ]
}